Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: ཡེ་ཤེས་སྣང་བ་ཁོང་དུ་ཆུད་པར་ནུས་རེ་སྐན།
en: How could I comprehend the light of their wisdom? “Depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་རྒྱ་མཚོ་བརྟན་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this southern region there is a town called Samudra­pratiṣṭhāna, where dwells an upāsikā by the name of Prabhūtā.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་ཚིག་ཐོས་ནས་སྤུ་གཡོས་ཏེ།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: དགའ་བ་ཆེན་པོའི་ཤུགས་སྐྱེས་ནས།
en: When Sudhana, the head merchant’s son, heard the words of the kalyāṇamitra, the hairs on his body rose, he felt a powerful great happiness, and he had great joy in his mind.

source: རབ་ཏུ་དགའ་བའི་ཡིད་དང་ལྡན་པར་གྱུར་བ་ངོ་མཚར་གྱི་བསམ་པ། རིན་པོ་ཆེ་རབ་ཏུ་དཀོན་པ་ཐོབ་པ།
en: He had obtained this rare, wonderful jewel of motivation.

source: འགྲོ་བ་མང་པོ་ལ་ཕན་པའི་སེམས་དང་བསམ་པས་བྱུང་བ་སངས་རྒྱས་སྐྱེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པར་འགྲོ་བ་ལ་དབང་བསྒྱུར་བ།
en: He had developed the motivation of intending to benefit many beings. He had the power to encounter the successive appearances of the buddhas.

source: ཆོས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པའི་བློ་གྲོས་ལ་རྟེན་པ།
en: He was dedicated to understanding the pure field of the Dharma.

source: ཐམས་ཅད་དུ་རྗེས་སུ་སོང་པའི་རིག་པ་རྣམ་པར་ཕྱེ་བས་འབྱུང་བ་བསྟན་པ་ལ་བརྩོན་པ། དུས་གསུམ་གྱི་དབྱིངས་སུ་མ་འདྲེས་པའི་སངས་རྒྱས་ཀྱི་ཡུལ་དང་ལྡན་པ།
en: He was dedicated to demonstrating setting forth to liberation in different ways appropriate to all places. He knew the distinct ranges of activity of the buddhas in the levels of the three times.

source: བསོད་ནམས་མི་ཟད་པའི་རྒྱ་མཚོ་ལས་བྱུང་བའི་སེམས་དང་ལྡན་པ།
en: He had a state of mind that had arisen from an inexhaustible ocean of merit.

source: ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོ་ལ་དབང་བསྒྱུར་བ།
en: He had the power of the illumination of great wisdom.

source: ཁམས་གསུམ་གྱི་ཁྱིམ་དུ་སྡུད་པའི་སྒོ་ཤིན་ཏུ་གཅོད་པ་དེས།
en: He had broken open the gate that sealed beings within the city of the three realms.

source: ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གི་དྲུང་ནས་སོང་ངོ་།
en: Sudhana bowed his head to the feet of the boy Indriyeśvara, circumambulated the boy Indriyeśvara many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the boy Indriyeśvara. Prabhūtā

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་འཛིན་པ་བྱེད་ཅིང་།
en: Sudhana, the head merchant’s son, had obtained the rain from the cloud of the instructions of the kalyāṇamitras.

source: གང་ཆེན་མཚོ་ལྟར་སྤྲིན་ཆེན་པོའི་ཆར་གྱིས་ངོམས་མྱི་ཤེས་པ་དགེ་བའི་བཤེས་གཉེན་གྱི་ཉི་མའི་ཡེ་ཤེས་ཀྱི་འོད་གཟེར་གྱིས་དགེ་བ་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་ས་གཞི་ལས་དབང་པོའི་མྱུ་གུ་འཐོན་ཅིང་སྐྱེས་བ།
en: He was like the ocean that never has too much rain from the clouds. The light from the sun of the wisdom of the kalyāṇamitras had caused the seedling of his powers to sprout from the ground of his ripened good karma.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཟླ་བ་ཉ་ཞིང་རྒྱས་པའི་གདམས་ངག་གི་འོད་གཟེར་གྱི་དྲ་བས་ལུས་དང་། སེམས་ཤིན་ཏུ་ཚིམ་པར་བྱས་བ།
en: The net of light rays from the full moon of the instructions of the kalyāṇamitras had brought ease to his mind and body.

source: །དཔྱིད་ཀྱི་ཉི་མའི་འོད་ཀྱིས་གདུངས་པའི་རི་དགས་ཀྱི་ཚོགས་གསལ་ཞིང་བསིལ་བའི་གངས་ཆུ་ལ་འཐུང་བར་འདོད་པ་ལྟར། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་ཆུ་ལ་འཐུང་བར་འདོད་པ།
en: Like the herds of deer who wish to drink the clear, cooling water from the Himalayas when they are tormented by the heat of the summer sun, he longed to drink the water of the instructions of the kalyāṇamitras.

source: བུང་བ་མང་པོ་འཁོར་ཞིང་ལྡིང་བས་རྒྱས་པར་གྱུར་པའི་པད་མོ་དང་ལྡན་པའི་པདྨོའི་མཚོ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གིས་སེམས་ཀྱི་མེ་ཏོག་བུན་ད་རི་ཀ་ཁ་ཕྱེ་བ།
en: The white lotuses of his mind had blossomed through the instructions of the kalyāṇamitras to become a lotus pond like a pond with a bed of blossomed lotuses over which hovers a swarm of bees.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་རྒྱས་པའི་རིན་པོ་ཆེའི་གླིང་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་རིན་པོ་ཆེ་འཕེལ་བའི་སྣང་བས་སེམས་ཤིན་ཏུ་སྣང་བར་བྱས་བ།
en: The jewels of the instructions of the kalyāṇamitras, like the island of jewels that is completely filled with all kinds of jewels, continuously illuminated the mind.

source: འཛམ་བུའི་ཤིང་ཆེན་པོའི་མེ་ཏོག་དང་། འབྲས་བུའི་ཚོགས་ཆེན་པོ་དང་ལྡན་པ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་གྱུར་པ། །ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ།
en: Like the great accumulation of flowers and fruit on the great Jambu tree, the instructions of the kalyāṇamitras have a perfect accumulation of merit and wisdom.

source: ཀླུའི་དབང་པོ་ཆེན་པོ་རྩེད་མོ་དམ་པས་རྩེ་བ་ལས་བྱུང་བའི་ནམ་མཁའི་སྤྲིན་ཆེན་པོ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ཐོས་པའི་ཚོགས་སུ་གྱུར་པའི་རྣང་ཤིན་ཏུ་ཆེ་བ། །སུམ་ཅུ་རྩ་གསུམ་པའི་འཇིག་རྟེན་གྱི་བརྒྱན་པའི་སྣ་ཚོགས་ཀྱི་སྤོ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལས་བྱུང་བའི་ཆོས་དྲི་མ་མྱེད་པ་སྣ་ཚོགས་བརྩེགས་པའི་སྤོར་གྱུར་པ། སུམ་ཅུ་རྩ་གསུམ་པའི་ཚོགས་ཀྱི་འཁོར་གྱིས་བསྐོར་བའི་བརྒྱ་བྱིན་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་ཚོགས་རབ་ཏུ་འཇོམས་པ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལས་བྱུང་བའི་ཡོན་ཏན་དྲི་མ་མྱེད་པའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་ཟིལ་གྱིས་མྱི་གནོན་ལ་གཞན་ལ་ཟིལ་གྱིས་གནོན་པ་དེ།
en: Like the great clouds in the sky born from the sublime play of the great lords of serpents, the accumulation of instructions heard from the kalyāṇamitras expanded. The towering mass of the various stainless Dharmas of the instructions of the kalyāṇamitras was like the variegated summit of the Trāyastriṃśa paradise. Just as Śakra and his entourage of the host of Trāyastriṃśa devas defeat the hosts of the lord of the asuras, the entourage of the host of the stainless qualities that arise from the instructions of the kalyāṇamitras cannot be surpassed but overwhelm others.

source: མཐར་གྱིས་གྲོང་ཁྱེར་རྒྱ་མཚོ་བརྟན་པ་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Eventually he arrived at the town called Samudra­pratiṣṭhāna.

source: དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས་དེ་ལ་སྐྱེ་བོ་མང་པོས་བསྟན་ཏེ། རིགས་ཀྱི་བུ་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་དེ་གྲོང་ཁྱེར་གྱི་དབུས་ཀྱི་རང་གི་ཁྱིམ་ན་འདུག་གོ་ཞེས་ནས།
en: When he was searching for the upāsikā Prabhūtā, a great crowd of people told him, “Noble one, the upāsikā Prabhūtā is in her house in the middle of the city.”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་གནས་གང་ན་བ་དེར་སོང་སྟེ།
en: Sudhana, the head merchant’s son, went to the home of the upāsikā Prabhūtā, and with his palms together in homage, he stood at the door.

source: ཐལ་མོ་སྦྱར་ནས་སྒོ་གང་ན་སྡོང་སྡོད་པ་དང་། དེས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་ཁྱིམ་དེ་ཤིན་ཏུ་རྒྱ་ཆེ་ལ་ཡངས་ཤིང་རིན་པོ་ཆེའི་ར་བས་ཡོངས་སུ་བསྐོར་བ་ཕྱོགས་བཞི་ནས་སྒོ་ཤིན་ཏུ་མཛེས་པ་རྣམ་པར་ཕྱེ་བ།
en: He saw that the upāsikā Prabhūtā’s house was encircled by a large and extensive precious wall. It had a gateway in each of the four directions and was adorned with countless measureless jewels that had been created from the ripening of merit.

source: རིན་པོ་ཆེ་ཚད་མྱེད་གྲངས་མྱེད་པའི་རྒྱན་གྱིས་བརྒྱན་པ། བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པས་མངོན་པར་གྲུབ་པ་མཐོང་ནས། དེ་ཁྱིམ་དེར་སོང་སྟེ།
en: Sudhana entered the house, looked around, and saw the upāsikā Prabhūtā seated on a precious throne.

source: ཀུན་ཏུ་བལྟས་ན་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ན་ཆུང་ཤིན་ཏུ་གཞོན་པ་ཐོག་མ་དར་ལ་བབ་པ།
en: She was a very young maiden who had newly become an adult, having just reached puberty.

source: གཟུགས་མངོན་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཁ་དོག་དམ་པ། པྲི་ཡབ་ཤིན་ཏུ་རྒྱས་པ་དང་ལྡན་པ།
en: She was surpassingly beautiful, attractive, and lovely to look at. Her skin was an excellent, perfect color.

source: སྐྲ་ཕྱེ་མར་བཞག་པ།
en: Her hair hung loose.

source: ལུས་ལ་རྒྱན་མྱེད་པ།
en: She wore no jewelry.

source: གོས་དང་སྨད་གཡོགས་དཀར་པོ་བགོས་པ།
en: She wore a white robe and skirt.

source: རིན་པོ་ཆེའི་ཁྲི་ལ་འདུག་པ་མཐོང་སྟེ།
en: Every being who saw the upāsikā Prabhūtā, whether deva or human, conceived of the upāsikā Prabhūtā as being their teacher.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་མ་གཏོགས་པར་དེའི་ལུས་སམ། སེམས་ཀྱི་དབང་ངམ། གཟི་བརྗིད་དང་། ཁ་དོག་གིས་ཟིལ་གྱིས་མ་ནོན་པའི་སེམས་ཅན་ནི་ཁྱིམ་དེ་ན་གང་ཡང་མྱེད་དེ། ལྷའམ་མིའང་རུང་སྟེ། སེམས་ཅན་གང་གིས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་མཐོང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་། དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ལ་སྟོན་པའི་འདུ་ཤེས་སུ་བསམ་པ་ཞིག །རིན་པོ་ཆེའི་ཁྲི་ལ་འདུག་པ་མཐོང་ངོ་།
en: Apart from buddhas and bodhisattvas, everyone else who came into that house was overwhelmed by her body, the power of her mind, her majesty, and her color.

source: །གཞན་ཡང་ཁྱིམ་དེ་ན་སྟན་ལྷ་རྫས་དང་། མྱིའི་རྫས་ལས་ཤིན་ཏུ་འཕགས་པ།
en: Also, a hundred trillion seats had been arranged in that house. They were superior to any human or deva seat.

source: བྱང་ཆུབ་སེམས་དཔའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཡོངས་སུ་གྲུབ་པ་བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཏིང་བ་དང་། མདུན་དུ་ཕྲུ་བ་གཅིག་ཅིག་བཞག་པ་ལས་ཁ་ཟས་དང་སྐོམ་གྱི་བག་གམ།
en: They had been created through the ripening of a bodhisattva’s karma.

source: གོས་དང་རྒྱན་གྱི་ལོངས་སྤྱོད་ཀྱི་བག་གཞན་ཅི་ཡང་མྱི་སྣང་ངོ་།
en: Sudhana did not see any store of food or drink in the house, nor did he see any store of clothing, jewelry, or possessions apart from a single small pot placed before her.

source: །བུད་མྱེད་སྟོང་ཕྲག་བཅུ་ཙམ་ཞིག་མདུན་དུ་འདུག་པར་མཐོང་ནའང་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷའི་བུ་མོའི་ཁ་དོག་དང་ལྡན་པ། ལྷའི་བུ་མོའི་གཟུགས་དང་ལྡན་པ། ལྷའི་བུ་མོའི་ཚུལ་དང་ལྡན་པ། ལྷའི་བུ་མོའི་སྤྱོད་པ་དང་ལྡན་པ།
en: Sudhana saw ten thousand maidens in front of her.

source: ལྷའི་བུ་མོའི་ལོངས་སྤྱོད་དང་ལྡན་པ། ལྷའི་བུ་མོའི་ཚུལ་དུ་ཤིས་པ་དང་ལྡན་པ། ལྷ་རྫས་ཀྱི་གོས་ཡིད་བཞིན་དུ་གྱོན་པ། ལྷ་རྫས་ཀྱི་ལྷབ་ལྷུབ་ཀྱིས་ཤིན་ཏུ་ཀླུབས་པ། ལྷའི་བུ་མོའི་སྐད་ལྟ་བུའི་དབྱངས་སྙན་པ་དང་ལྡན་པ་ལྷའི་བུ་མོའི་ཆུ་ཞེང་མཛེས་པ་དང་ལྡན་པ་ཤ་སྟག་སྟེ།
en: They all had the skin color of apsarases, the bodies of apsarases, the manner of apsarases, the behavior of apsarases, the pleasures of apsarases, the courtesy of apsarases, the divine clothing of apsarases, the jewelry of apsarases, and the beautiful-sounding voices of apsarases, and their waists were like those of apsarases.

source: དེའི་འཁོར་གྱི་བུད་མྱེད་ཀྱང་དེས་ཅི་བསྒོ་བ་བཞིན་དུ་བྱེད་ཅིང་མདུན་ན་འཁོད་དོ། །རིམ་གྲོ་བྱེད་དོ། །བཀུར་སྟི་བྱེད་དོ། །གདོང་དུ་ལྟའོ། །ཅི་བསྒོ་བ་ཉན་ཅིང་གནས་སོ། །རྗེ་སར་འཁོད་དོ། ཡོངས་སུ་ལྟའོ། རྣམ་པར་ལྟའོ། །འདུད་དོ།
en: Her entourage of maidens was stationed before her, fulfilling all her instructions, gazing upon her, honoring her, venerating her, showing her respect, facing her, listening to her, looking upon her, gazing upon her, bowing down to her, making obeisance to her, and paying homage to her.

source: །རབ་ཏུ་འདུད་དོ། །ཕྱག་འཚལ་ལོ། །དེ་དག་གི་ལུས་ལས་སྤོས་ཀྱི་ངད་ལྡང་བས་ནི། གྲོང་ཁྱེར་དེའི་འཁོར་ཐམས་ཅད་དུ་དྲི་ཞིམ་པོས་ཁྱབ་པར་འདུག་སྟེ། སེམས་ཅན་གང་གིས་དྲི་དེ་ཚོར་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གནོད་སེམས་མྱེད་པའི་སེམས་དང་། ཤར་གཉེར་བ་མྱེད་པའི་སེམས་དང་། འཚེ་བ་མྱེད་པའི་སེམས་དང་། ཕྲག་དོག་དང་། འཇུངས་པ་དང་བྲལ་བའི་སེམས་དང་། སྒྱུ་དང་གཡོ་མྱེད་པའི་སེམས་དང་། ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་མྱེད་པའི་སེམས་དང་། ཞུམ་པ་དང་། གཟེངས་མཐོང་བ་མྱེད་པའི་སེམས་དང་། བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་། སྡོམ་པ་ལ་གནས་པའི་སེམས་དང་། གཞན་གྱིས་ཡོངས་སུ་བཟུང་བ་ལ་རེ་བ་མྱེད་པའི་སེམས་སུ་གྱུར་ཏེ།
en: The perfume that emanated from their bodies filled the entire surrounding town with its pleasant aroma, and when beings smelled that aroma, they all ceased to have malice in their minds, ceased to have animosity in their minds, ceased to have aggression in their minds, ceased to have jealousy and greed in their minds, ceased to have deception and deceit in their minds, ceased to have craving and anger in their minds, ceased to go back and forth between low and high spirits, and had loving minds, altruistic minds, self-controlled minds, and minds that did not wish to acquire the possessions of others.

source: གང་གིས་དེ་དག་གི་སྐད་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དགའ་བ་དང་། མོས་པ་དང་། དུལ་བའི་སེམས་དང་ལྡན་པར་འགྱུར་རོ། །གང་གིས་དེ་དག་མཐོང་བར་གྱུར་པ་དེ་དག་ཀྱང་། འདོད་ཆགས་དང་བྲལ་བ་ཙམ་དུ་རང་རང་གིས་ཤེས་པར་འགྱུར་རོ།
en: All those who heard the voices of those maidens became delighted, reverent, and subdued.

source: དེ་ལྟར་མཐོང་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་བསྙེན་མ་ཕུལ་དུ་བྱུང་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ།
en: Having seen this, Sudhana, the head merchant’s son, bowed his head to the feet of the upāsikā Prabhūtā, circumambulated her many hundreds of thousands of times, keeping her to his right, and sat before her.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: With his palms together in homage, Sudhana said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། བསོད་ནམས་ཀྱི་མཛོད་མྱི་ཟད་པའི་རྒྱན་ཅེས་བྱ་བ་ཐོབ་པ་སྟེ།
en: The upāsikā Prabhūtā said, “Noble one, I have attained the bodhisattva liberation called the unceasing display of the treasure of merit

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་ཕྲུ་བ་གཅིག་པོ་འདི་ལས་མོས་པ་སྣ་ཚོགས་ཅན་རྣམས་ཁ་ཟས་ཅི་ལ་དགའ་བ་བཞིན་དུ་ཚོད་མ་སྣ་ཚོགས་དང་། རོ་སྣ་ཚོགས་དང་། ཁ་དོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་ཀྱིས་ཚིམ་པར་བྱེད་དེ།
en: “Noble one, from this small pot, beings with different wishes are satisfied by whatever foods they enjoy, with various kinds of broths, various flavors, various colors, and various aromas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་ནི་ཕྲུ་བ་གཅིག་པོ་འདི་ལས་ཅི་ལ་དགའ་བའི་ཁ་ཟས་ཀྱིས་སེམས་ཅན་བརྒྱ་འང་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ།
en: “Noble one, in that way, with this one small pot I can satisfy a hundred beings with the foods they enjoy.

source: །སེམས་ཅན་སྟོང་དང་སེམས་ཅན་བརྒྱ་ཕྲག་སྟོང་དང་། སེམས་ཅན་བྱེ་བ་དང་། སེམས་ཅན་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སེམས་ཅན་བྱེ་བ་ཕྲག་སྟོང་དང་། སེམས་ཅན་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ནས། སེམས་ཅན་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པ་མོས་པ་སྣ་ཚོགས་ཅན་རྣམས་ཀྱང་ཅི་ལ་དགའ་བའི་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །ཡོངས་སུ་སྟོབས་པར་བྱེད་དོ།
en: I can satisfy with the foods they enjoy a hundred thousand beings, ten million beings, a billion beings, a trillion beings, a quintillion beings, and an innumerably-beyond-an-innumerable number of beings with different wishes.

source: །ཡོངས་སུ་དགའ་བར་བྱེད་དོ། ཡོངས་སུ་མགུ་བར་བྱེད་དོ། །ཡོངས་སུ་སྤྲོ་བར་བྱེད་དོ། །ཤིན་ཏུ་ཚིམ་པར་བྱེད་དོ། །ཡིད་བདེ་བར་བྱེད་དོ།
en: I strengthen them, make them joyful, please them, delight them, make them content, and make them happy.

source: །འོན་ཀྱང་ཕྲུ་བ་འདི་ལས་འགོང་བར་འགྱུར་བ་མེད་དོ། །འགྲིབ་མྱེད་དེ་དམའ་བར་མྱི་འགྱུར་རོ། །ཟད་པར་མྱི་འགྱུར་རོ། འབྲི་བར་མྱི་འགྱུར་རོ། །ས་མཚམས་ཡོད་པར་མྱི་འགྱུར་རོ། །མཐར་ཐུག་པར་མྱི་འགྱུར་རོ། །མུར་ཐུག་པར་མྱི་འགྱུར་རོ།
en: Nevertheless, this small pot is never diminished, depleted, emptied, used up, exhausted, spent, or finished, nor does it ever come to an end.

source: །རིགས་ཀྱི་བུ་གཞུང་དེ་དང་འདྲ་བར་སེམས་ཅན་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། དེ་བཞིན་དུ་གླིང་བ་ཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ནས་སེམས་ཅན་མོས་པ་སྣ་ཚོགས་ཅན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་འོངས་ཀྱང་། ཅི་ལ་དགའ་བའི་ཁ་ཟས་ཚོད་མ་སྣ་ཚོགས་དང་། རོ་སྣ་ཚོགས་དང་། ཁ་དོག་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །ཡོངས་སུ་དགའ་བར་བྱེད་དོ། །ཉམས་བདེ་བར་བྱེད་དོ། །ཤིན་ཏུ་ཚིམ་པར་བྱེད་དོ།
en: “Noble one, in the same way, I can satisfy, make joyful, please, delight, make content, and make happy, with whatever foods they enjoy and with various kinds of broths, various flavors, various colors, and various aromas, beings with different wishes who are as numerous as the atoms in a world realm of four continents, as numerous as the atoms in a world realm of a thousand four-continent worlds, as numerous as the atoms in a world realm of a million four-continent worlds, as numerous as the atoms in a world realm of a billion four-continent worlds, and as numerous as the atoms in innumerably more numerous than innumerable buddha realms.

source: ཡིད་ཤིན་ཏུ་བདེ་བར་བྱེད་དོ། །འོན་ཀྱང་ཕྲུ་བ་འདི་ལས་འགོང་བར་འགྱུར་བ་མྱེད་དོ། །འགྲིབ་པ་མྱེད་དོ། །དམའ་བར་མྱི་འགྱུར་རོ། །ཟད་པར་མྱི་འགྱུར་རོ།
en: “Nevertheless, this small pot is never diminished, depleted, emptied, used up, exhausted, spent, or finished, nor does it ever come to an end.

source: །ས་མཚམས་ཡོད་པར་མྱི་འགྱུར་རོ། །མཐར་ཐུག་པར་མྱི་འགྱུར་རོ། །མུར་ཐུག་པར་མྱི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་གལ་ཏེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གཏོགས་པའི་སེམས་ཅན་མོས་པ་སྣ་ཚོགས་ཅན་དང་། བསམ་པ་སྣ་ཚོགས་ཅན་ཐམས་ཅད་འོངས་པར་གྱུར་ན་ཡང་། དེ་དག་ཐམས་ཅད་ཅི་ལ་དགའ་བའི་ཁ་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་ནས།
en: “Noble one, if the beings in all world realms in the ten directions, all with different wishes and aspirations, were all to come here, they would all be satisfied and so on up to made happy by the food they enjoy.

source: ཡིད་བདེ་བར་བྱ་བའི་བར་དུ་བྱེད་དོ། །ཁ་ཟས་སྣ་ཚོགས་ཀྱིས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བཏུང་བ་རྣམ་པ་སྣ་ཚོགས་དང་། རོ་རྣམ་པ་སྣ་ཚོགས་དང་། སྟན་སྣ་ཚོགས་དང་། མལ་ཆ་སྣ་ཚོགས་དང་། བཞོན་པ་སྣ་ཚོགས་དང་། གོས་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་། ཕྲེང་བ་སྣ་ཚོགས་དང་། སྤོས་སྣ་ཚོགས་དང་། བདུག་སྤོས་སྣ་ཚོགས་དང་། བྱུག་པ་སྣ་ཚོགས་དང་། ཕྱེ་མ་སྣ་ཚོགས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། རྒྱན་སྣ་ཚོགས་དང་། རིན་པོ་ཆེའི་ཤིང་རྟ་སྣ་ཚོགས་དང་། གདུགས་སྣ་ཚོགས་དང་། རྒྱལ་མཚན་སྣ་ཚོགས་དང་། ལྷའི་བ་དན་སྣ་ཚོགས་དང་། ཡོ་བྱད་ཀྱི་ཡུལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་ནས། ཡིད་དགའ་བར་འགྱུར་བའི་བར་དུ་བྱེད་དོ།
en: Just as it would be with various kinds of food, they would all be satisfied and so on up to made happy by various kinds of drinks, by various kinds of flavors, by various kinds of seats, by various kinds of beds, by various kinds of steeds, by various kinds of clothing, by various kinds of flowers, by various kinds of garlands, by various kinds of perfume, by various kinds of incense, by various kinds of ointments, by various kinds of powders, by various kinds of jewels, by various kinds of jewelry, by various kinds of precious carriages, by various kinds of parasols, by various kinds of banners, by various kinds of flags, and by various kinds from among the entire range of utensils.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་སྐུའི་ཐ་མ་འཛིན་པ་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཅིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱི་འབྲས་བུ་བརྙེས་པར་མཛད་དོ།
en: “Moreover, noble one, all the śrāvakas and pratyeka­buddhas in a single world realm in the east, who are in their final life, attain the result of the śrāvaka and pratyeka­buddha enlightenments by eating my food.

source: །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ནས།
en: Just as it is in one realm in the east, so it is in a hundred world realms, a thousand world realms, a hundred thousand world realms, ten million world realms, a billion world realms, ten billion world realms, a hundred billion world realms, a quintillion world realms, and world realms as numerous as the atoms in the world realm of Jambudvīpa, as the atoms in a world realm of four continents, as the atoms in a world realm of a thousand four-continent worlds, as the atoms in a world realm of a million four-continent worlds, and as the atoms in a world realm of a billion four-continent worlds.

source: དེ་བཞིན་དུ་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་སྐུའི་ཐ་མ་འཛིན་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཅིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་འབྲས་བུ་བརྙེས་པར་མཛད་དོ།
en: “In the same way, all the śrāvakas and pratyeka­buddhas in world realms as numerous as the atoms in innumerably more numerous than innumerable buddha realms in the east, who are in their final life, will attain the result of the śrāvaka and pratyeka­buddha enlightenments by eating my food.

source: །ཤར་ཕྱོགས་ན་བཞུགས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ན་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ།
en: “Just as it is for those who are in the east, so it is for all of those who are in the south, in the west, in the north, in the northeast, in the southeast, in the southwest, in the northwest, below, and above.

source: །རིགས་ཀྱི་བུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁ་ཟས་ལས་གསོལ་ཅིང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་བཞུགས་ནས་བདུད་སྡེ་དང་བཅས་པ་ཕམ་པར་མཛད་དེ། བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: “Noble one, all those who are bodhisattvas in their last life in a single world realm in the east will, by eating my food, be seated at the bodhimaṇḍa, defeat Māra and his armies, and attain the highest, complete enlightenment of buddhahood.

source: །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་བཞུགས་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དང་། འཇིག་རྟེན་གྱི་ཁམས་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ནས།
en: “Just as it is for those in one realm in the east, so it is in a hundred world realms, a thousand world realms, a hundred thousand world realms, ten million world realms, a billion world realms, ten billion world realms, a hundred billion world realms, a quintillion world realms, and world realms as numerous as the atoms in the world realm of Jambudvīpa, as the atoms in a world realm of four continents, as the atoms in a world realm of a thousand four-continent worlds, as the atoms in a world realm of a million four-continent worlds, and as the atoms in a world realm of a billion four-continent worlds.
